<?php
// Cria slug com palavras ou frases
// Desenvolvido por: blinkner

function slugify($nome):string {
    $slug = $nome;
    $slug = trim($slug);

    $caracteres =  array(
                "- " => "",
                ":" => "",
                " " => "-",
                "á" => "a",
                "Á" => "A",
                "à" => "a",
                "À" => "A",
                "ã" => "a",
                "Ã" => "A",
                "â" => "a",
                "Â" => "A",
                "é" => "e",
                "É" => "E",
                "ê" => "e",
                "Ê" => "E",
                "í" => "i",
                "Í" => "I",
                "õ" => "o",
                "Õ" => "O",
                "ô" => "o",
                "Ô" => "O",
                "ó" => "o",
                "Ó" => "O",
                "ú" => "u",
                "Ú" => "U",
                "ç" => "c",
                "Ç" => "C",
                "¹" => "",
                "²" => "",
                "³" => "",
                "!" => "",
                "@" => "",
                "#" => "",
                "$" => "",
                "£" => "",
                "%" => "",
                "¢" => "",
                "¨" => "",
                "¬" => "",
                "*" => "",
                "(" => "",
                ")" => "",
                "_" => "",
                "+" => "",
                "=" => "",
                "§" => "",
                "/" => "",
                "?" => "",
                "°" => "",
                "ª" => "",
                "º" => "",
                "´" => "",
                "`" => "",
                "{" => "",
                "}" => "",
                "[" => "",
                "]" => "",
                "^" => "",
                "~" => "",
                "." => "",
                "," => "",
                "|" => "",
                "&amp;" => "e",
                "&lt;" => "",
                "&gt;" => "",
                "&quot" => "",
                "&039;" => "",
                ";" => "");
    
    foreach ($caracteres as $key => $value) {
        $slug = str_replace($key, $value, $slug);
    }

    $slug = strtolower($slug);

    return $slug;
}

echo slugify("Olá, Mundo!");
